# KilowattHours Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KilowattHours Property
UnitTypeId Class See Also
---
Kilowatt hours.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KilowattHours { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KilowattHours As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KilowattHours {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace